/* 应用程序 walk.c,用'*'移动标识键盘输入 */

/* 系统调用声明头文件 */
#include "apilib.h"

void HariMain(void)
{
    char *buf;
    int win, i, x, y;

    /* 初始化应用程序内存分配;分配160*100字节用作新建窗口画面信息缓冲区;
     * 新建160*100大小标题为walk无透明色的窗口,在窗口[(4,24),(155,95)]区
     * 域绘制色号为0的矩形,在窗口[76,56]位置处以色号3显示1个'*'号。*/
    api_initmalloc();
    buf = api_malloc(160 * 100);
    win = api_openwin(buf, 160, 100, -1, "walk");
    api_boxfilwin(win, 4, 24, 155, 95, 0);
    x = 76;
    y = 56;
    api_putstrwin(win, x, y, 3 1, "*");
    
    for (;;) {
        /* 获取向本任务输入的数据, */
        i = api_getkey(1);
        /* 在窗口(x,y)位置以色号0描绘1个'*'号 */
        api_putstrwin(win, x, y, 0 /* �� */, 1, "*");
        /* 当输入'4'时, 横坐标左移8个像素点;
         * 当输入'6'时, 横坐标右移8个像素点;
         * 当输入'8'时, 纵坐标下移8个像素点;
         * 当输入'2'时, 纵坐标上移8个像素点。
         * 输入回车结束循环。*/
        if (i == '4' && x >   4) { x -= 8; }
        if (i == '6' && x < 148) { x += 8; }
        if (i == '8' && y >  24) { y -= 8; }
        if (i == '2' && y <  80) { y += 8; }
        if (i == 0x0a) { break; }
        /* 最新移动点以色号3绘制一个'*'符号 */
        api_putstrwin(win, x, y, 3 /* �� */, 1, "*");
    }
    /* 关闭应用程序窗口退出应用程序 */
    api_closewin(win);
    api_end();
}
